from flask import Flask, render_template, request
import random

app = Flask(__name__)

def get_constellation(month, day):
    dates = (21, 20, 21, 21, 22, 22, 23, 24, 24, 24, 23, 22)
    constellations = ("摩羯座", "水瓶座", "雙魚座", "牡羊座", "金牛座", "雙子座", "巨蟹座", "獅子座", "處女座", "天秤座", "天蠍座", "射手座", "魔羯座")

    if day < dates[month-1]:
        return constellations[month-1]
    else:
        return constellations[month]

def mpl(name):

    if name == "牡羊座":
        return "2448"
    elif name == "獅子座":
        return "2353"
    elif name == "雙子座":
        return  "2454"
    elif name == "射手座":
        return  "2888"
    elif name == "天蠍座":
        return  "2883"
    elif name == "雙魚座":
        return  "2330"
    elif name == "水瓶座":
        return  "2347"
    elif name == "處女座":
        return  "2303"
    elif name == "巨蟹座":
        return  "1216"
    elif name == "天秤座":
        return  "2912"
    elif name == "魔羯座":
        return  "2311"
    elif name == "金牛座":
        return  "2891"
    else:
        return "ERROR"



@app.route('/')
def index():
    return render_template('index.html')

@app.route('/handle_data', methods=['POST'])
def handle_data():
    month = request.form['month']
    day = request.form['day']

    try:
        name = get_constellation(int(month), int(day))
        pic1 = mpl(name)
    except Exception as e:
        return "<h1>發生錯誤！！！</h1>" + "錯誤訊息如下：" + "<br>" + str(e.args)

    description1 = "您的星座是" + name
    description2 = "特質為" + random.choice(personalities[name])
    description3 = "我們為您推薦的股票是 -- " + pic1

    return render_template('results.html', name=name, description1=description1,description2=description2,description3 = description3,pic1=pic1)


personalities = {}
personalities['牡羊座'] = ["倔強。遇到討厭的人，寧可受罪也不向對方求助。","率真坦白，討厭被欺騙。",
                        "冷漠。對惹火他和糾纏不休的人表現得異常明顯。","不圓滑不世故不記仇。遇事常猶豫，難以選擇。",
                        "對繁瑣的事情沒耐心，容易放棄。","心地善良，樂於助人。即使不喜歡的也盡力完成。",
                        "心軟。即使受傷，一旦對方道歉便忍不住說沒關係。","陌生人面前很安靜很慢熱，熟了很鬧騰。",
                        "有點小脾氣但很隱忍。不輕易表露自己性情和內心。"]

personalities["金牛座"] = ["吃軟不吃硬，經常口是心非。","樂觀又悲觀。安全感不多，有點感性。",
                        "朋友求助常有求必應，所以易被騙。","害怕受傷。對陌生人冷冷的，熟悉後就嘻嘻哈哈。",
                        "故作堅強，其實很軟弱。被人誤解卻不願解釋。多愁善感，總為小事糾結。",
                        "自尊心暴強有點不自信。討厭和人打交道，常年宅在家。","超懶，最愛睡覺和發呆。擅長裝傻。",
                        "喜歡錢但不在乎。討厭幹沒有意義的事。","喜歡故意讓人抓狂。最怕被冷落和不在乎。"]

personalities["雙子座"] = ["善忘。不論重不重要的事都容易忘記。不記仇。","偏執悲觀、追求完美，有輕微強迫症和潔癖。",
                        "熱愛暗戀，有點悶騷。","容易被感動。心思細膩，不願與人計較。","黑白分明。喜歡被肯定和信任。討厭耍心機。",
                        "玩心重。熱愛自由，討厭被束縛壓迫。喜歡挑戰。","雙重人格，性格較極端。有輕微自閉。",
                        "渴望被理解，卻不奢求理解。對別有用心之人一眼就能看穿，並視若無睹。","非常注重第一印象。幾乎一見定生死。"]

personalities["巨蟹座"] = ["喜歡裝堅強.裝冷酷。讓人捉摸不透。","隱藏悲傷。卻希望別人安慰它、給它安全感。",
                        "愛幻想。有人懂它愛它能給它所想要的。","浪漫體貼。細心關愛自己愛的人。","外表孩子氣，內心卻很成熟。",
                        "害怕被忽略，對人關心也不表露出來。","內心藏著無數秘密，只和最親密的人分享。",
                        "慢熱。陌生人面前十分文靜。遇見開心的事會說個不停，不開心會躲起來哭。","情緒化。愛撒嬌，超級黏人。喜歡賴床。"]

personalities["獅子座"] = ["霸道且控制慾強。其實是沒安全感。喜歡佔主導地位，被讚美。","愛整潔。即使是獅子男也十分愛整潔。",
                        "喜歡胡思亂想。性格較極端。","喜歡裸睡。","淚腺發達，易被感動。喜歡跟愛人人身體接觸，恨不得把身體揉進去那種。",
                        "有些悲觀。有較強的依賴感。","偏執，苛求完美。具有雙重性格，很抗拒有人走近。",
                        "經常表現出不在乎，無所謂的態度。其實內心彆扭的很。","常表現強勢，其實內心十分脆弱孤獨。"]

personalities["處女座"] = ["敏感多疑。喜歡胡思亂想，愛鑽牛角尖。","冷靜。即使內心起伏再大也十分理智冷靜。",
                        "害怕失去。總表現得不冷不熱讓人難以靠近。","死要面子愛逞強。即使傷心也表現得十分強勢。",
                        "缺乏耐心有點小自私。討厭等人自己又愛遲到。","傻傻愛著他、幫他做很多事，即使對方不愛自己。",
                        "追求完美。任何事情都希望做到最好。","愛較真。關鍵時刻敷衍了事，在他身上起不到任何作用。",
                        "內心溫和善良，會一直堅守在朋友愛人身邊。"]

personalities["天秤座"] = ["替他人著想。常試圖改變自己迎合對方。","外表親切熱情，內心追求安逸的環境。",
                        "對最親愛的人容易暴走脾氣，對外人和善常被說人好。","愛睡覺。對多數人和事不上心，不在意周圍太自我。忽冷忽熱。",
                        "超懶散。對任何事都抱隨遇而安的態度。","膽小害怕失敗，卻總表現出強悍的一面。",
                        "珍惜友誼。成為他死黨要很久經歷很多事。","很忍耐。什麼事都放在心裡自己承受。",
                        "不愛爭搶。認為屬於自己的是不需爭搶的。"]

personalities["天蠍座"] = ["有魅力。個性張揚或內斂都對旁人很有吸引力。","記仇。別輕易得罪蠍子，他可能一輩子都記得。",
                        "生氣抓狂的蠍子不可怕，沉默的蠍子才最可怕。","神秘。總希望別人瞭解自己內心。",
                        "直覺敏銳。不要在蠍子面前玩花招。","執著且敢愛敢恨。不斷付出卻又容易走向悲憤。",
                        "被動。因碰不到心動得讓他願意主動出擊的獵物。","對失去興趣的人理性冷酷。對待愛人卻感情用事。",
                        "佔有慾強烈。喜歡獨佔討厭和人分享。"]

personalities["射手座"] = ["強迫症，神經質。每晚睡覺前都覺得窗沒關，門沒鎖。","專一。喜歡一個人時喜歡的要死，眼裡容不下一粒沙子。",
                        "小孤僻，小高傲。看不慣的東西超多。","戀舊。一首喜歡的歌可以聽N年。",
                        "害怕孤獨。人前總是嘻嘻哈哈。","對愛人很偏執在乎，有神經質傾向。不輕易放手。",
                        "霸道。跟人吵架表現強勢。事後放下架子來哄人。","愛裝堅強，讓人疼惜。",
                        "自我感覺良好，其實有點冒失讓人無語。"]

personalities["魔羯座"] = ["吃軟不吃硬。","經常口是心非。",
                        "很樂觀又很悲觀。","安全感不多，有點感性。有些話即使害怕錯過也不說。",
                        "常常被人騙。有點小心軟、小敏感、小潔癖。","害怕受傷。總說自己不孤單，其實很寂寞。",
                        "在陌生人面前很冷淡，熟人面前很鬧騰。","總表現的很堅強，其實很軟弱。",
                        "總被人誤解，卻不願解釋。"]

personalities["水瓶座"] = ["喜歡簡單，不喜歡麻煩和累的感覺。","健忘不記仇。只要沒碰他底線，一切都是過眼雲煙。",
                        "有鬥志愛拚搏，刻苦努力。","別人對他好定加倍奉還的代表。",
                        "天生的統籌規劃專家，計劃性強。","固執。明知是錯也要往前走。撞了南牆就把牆拆了繼續走。",
                        "討厭做決定。就算是顏色不同也會讓他們苦惱半天。","愛笑，一點小事就笑逐顏開，什麼都寫​​在臉上。",
                        "愛憎分明，不給自己不喜歡的人絲毫機會，對自己喜歡的人超級縱容。"]

personalities["雙魚座"] = ["喜歡吃，頂級吃貨。","霸道，有很強佔有欲。",
                        "懶，超級怕麻煩。","愛捉弄人，事後還經常自鳴得意。",
                        "超自戀，沒事就愛臭美。","容易害羞，遇到喜歡的人反而會疏遠。",
                        "外冷內熱，對陌生人視而不見。","固執，不善於變通。",
                        "過於溫柔，經常把愛人慣壞。"]

if __name__=="__main__":
    app.run(debug=True)
